//=====================================================================
//
// test_template_lazy.cpp -
//
// Created by liubang on 2023/10/15 23:02
// Last Modified: 2023/10/15 23:02
//
//=====================================================================
#include <iostream>

/**
 * 编译器对模板的编译是“惰性”的，即只有当cpp文件中用到了这个模板，该模板里的函数才会被定义；
 * 下面一个模板很显然有语法错误，但是由于没有使用到该模板，所以程序也能正常编译并运行；
 */
template <typename T> void dummy() {
    // 语法错误!!!
    "字符串" = 1234;
}

int main(int argc, char* argv[]) {
    std::cout << "hello world\n";
    return 0;
}
